#include <stdio.h>

// int main() { 
//     // Сколько столов можно сделать из N ножек ?
//     // Дано целое число ножек 
//     // Напечатать сколько из них можно сделать столов.

//     int nogi;

//     scanf("%d", &nogi);

//     printf("%d", nogi / 4);

//     return 0;
// }

// int main() {
//     // Длина круга беговой дорожки на стадионе round метров. Студенты должны пробежать total метров.
//     // Напечатать:
//     // Сколько полных кругов должны пробежать студенты?
//     // В скольких метрах от старта надо поставить финиш?

//     int round, total;

//     scanf("%d%d", &round, &total);
//     printf("%d %d", total / round, total % round);

//     return 0; 

// }

// int main() {
//     // Даны длины сторон прямоугольника.
//     // Напечатайте его площадь.

//     float storonaA, storonaB;

//     scanf("%f%f", &storonaA, &storonaB);

//     printf("%f", storonaA * storonaB);

//     return 0; 
// }

int main() {
    // Площадь комнаты - s.
    // Длина одной стороны комнаты - w.
    // Ширина стула ch.
    // Вычислить сколько стульев res можно поставить у ДРУГОЙ стороны комнаты.

    int s, w;


    return 0;
}